Revit 2024 API
HostedSweep.AddSegment Method
Add segments to the hosted sweep object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract void AddSegment(
	Reference targetRef
)
Visual Basic
Public MustOverride Sub AddSegment ( _
	targetRef As Reference _
)
Visual C++
public:
virtual void AddSegment(
	Reference^ targetRef
) abstract
Parameters
targetRef
Type: Autodesk.Revit.DB.Reference
See Also
HostedSweep Class
Autodesk.Revit.DB Namespace